{
  "speakers": [
    {
      "id": "mike-droettboom",
      "first_name": "Mike",
      "last_name": "Droettboom",
      "photo": "mike-droettboom.webp",
      "affiliation": {
        "en": "CPython performance leader at Microsoft, impact on matplotlib, Pyodide, astropy, airspeed velocity, astronomy, computer vision, web technologies.",
        "es": "Líder de rendimiento de CPython en Microsoft, impacto en matplotlib, Pyodide, astropy, velocidad del aire, astronomía, visión por ordenador, tecnologías web."
      },
      "biography": {
        "en": "Michael Droettboom is a Principal Software Engineering Manager at Microsoft, leading CPython performance improvements. A veteran open-source contributor, he has worked on matplotlib, astropy, Pyodide, and airspeed velocity. His contributions have supported projects like the Hubble and James Webb Telescopes, Firefox, infrared retinal imaging, and optical sheet music recognition.",
        "es": "Michael Droettboom es Director Principal de Ingeniería de Software en Microsoft y dirige las mejoras de rendimiento de CPython. Veterano colaborador de código abierto, ha trabajado en matplotlib, astropy, Pyodide y airspeed velocity. Sus contribuciones han apoyado proyectos como los telescopios Hubble y James Webb, Firefox, imágenes infrarrojas de la retina y reconocimiento óptico de partituras."
      },
      "facebook": "",
      "twitter": "MDroettboom",
      "linkedin": "mdboom",
      "instagram": "",
      "github": "mdboom",
      "website": "",
      "country": "us"
    },
    {
      "id": "julia-silge",
      "first_name": "Julia",
      "last_name": "Silge",
      "photo": "julia-silge.webp",
      "affiliation": {
        "en": "Engineering manager at Posit PBC, leading development of open-source software for data science in Python, R. Data scientist, expertise in machine learning, text mining. PhD in astrophysics, author of books on data science.",
        "es": "Director de ingeniería en Posit PBC, dirige el desarrollo de software de código abierto para la ciencia de datos en Python y R. Científico de datos, experto en aprendizaje automático y minería de textos. Doctor en astrofísica, autor de libros sobre ciencia de datos."
      },
      "biography": {
        "en": "Julia Silge is an Engineering Manager at Posit PBC, leading the development of open-source software for data science in Python and R. A data scientist with expertise in machine learning and text mining, she holds a PhD in astrophysics and has co-authored books on data science. She is also a tool builder, author, and international keynote speaker.",
        "es": "Julia Silge es Directora de Ingeniería en Posit PBC, donde dirige el desarrollo de software de código abierto para la ciencia de datos en Python y R. Científica de datos con experiencia en aprendizaje automático y minería de textos, es doctora en astrofísica y coautora de libros sobre ciencia de datos. También es creadora de herramientas, autora y conferenciante internacional."
      },
      "facebook": "",
      "twitter": "",
      "linkedin": "juliasilge",
      "instagram": "",
      "github": "juliasilge",
      "website": "",
      "country": "us"
    },
    {
      "id": "angela-oliveira-pisco",
      "first_name": "Angela",
      "last_name": "Oliveira Pisco",
      "photo": "angela-oliveira-pisco.webp",
      "affiliation": {
        "en": "Head of Computational Biology at insitro, expert in biomedical data, cancer resistance, cellular differentiation, wound healing, leader in whole organism cell atlas projects, Open Problems in Single Cell founder.",
        "es": "Jefe de Biología Computacional en insitro, experto en datos biomédicos, resistencia al cáncer, diferenciación celular, cicatrización de heridas, líder en proyectos de atlas celular de todo el organismo, fundador de Open Problems in Single Cell."
      },
      "biography": {
        "en": "Angela Pisco is the Head of Computational Biology at insitro, specializing in biomedical data analysis, cancer resistance, and cellular differentiation. Her research has advanced understanding of wound healing and led major whole organism cell atlas projects. A founder of Open Problems in Single Cell, she is dedicated to improving multimodal data analysis in biology.",
        "es": "Angela Pisco es Directora de Biología Computacional en insitro y está especializada en análisis de datos biomédicos, resistencia al cáncer y diferenciación celular. Su investigación ha permitido avanzar en la comprensión de la cicatrización de heridas y ha dirigido importantes proyectos de atlas celular de todo el organismo. Fundadora de Open Problems in Single Cell, se dedica a mejorar el análisis multimodal de datos en biología."
      },
      "facebook": "angela.o.pisco",
      "twitter": "draopisco",
      "linkedin": "aopisco",
      "instagram": "aopisco",
      "github": "aopisco",
      "website": "",
      "country": "pt"
    },
    {
      "id": "erico-andrei",
      "first_name": "Érico",
      "last_name": "Andrei",
      "photo": "erico-andrei.webp",
      "affiliation": {
        "en": "Co-founder of Simples Consultoria and Pendect GmbH, PSF Fellow, former Plone Foundation president, Cookiecutter co-maintainer, leader in Python and Plone communities, key in PythonBrasil and PloneGov-BR.",
        "es": "Cofundador de Simples Consultoria y Pendect GmbH, PSF Fellow, ex presidente de Plone Foundation, co-mantenedor de Cookiecutter, líder en las comunidades Python y Plone, clave en PythonBrasil y PloneGov-BR."
      },
      "biography": {
        "en": "Érico Andrei is the co-founder of Simples Consultoria and Pendect GmbH, a PSF Fellow, and a former president of the Plone Foundation. A core developer of Plone and co-maintainer of Cookiecutter, he has been instrumental in growing the Python and Plone communities. He played a key role in PythonBrasil and PloneGov-BR, supporting open-source adoption in government and business.",
        "es": "Érico Andrei es cofundador de Simples Consultoria y Pendect GmbH, PSF Fellow y ex presidente de la Plone Foundation. Desarrollador principal de Plone y co-mantenedor de Cookiecutter, ha desempeñado un papel decisivo en el crecimiento de las comunidades de Python y Plone. Desempeñó un papel clave en PythonBrasil y PloneGov-BR, apoyando la adopción del código abierto en el gobierno y las empresas."
      },
      "facebook": "",
      "twitter": "ericof",
      "linkedin": "ericof",
      "instagram": "ericof",
      "github": "ericof",
      "website": "",
      "country": "br"
    },
    {
      "id": "shreya-gupta",
      "first_name": "Shreya",
      "last_name": "Gupta",
      "photo": "shreya-gupta.webp",
      "affiliation": {
        "en": "Solutions Architect in Gen-AI at Nvidia, AI model development expert. Master’s in Symbolic Systems from Stanford, research in deep learning and cognitive neuroscience. Advocate for diversity in STEM."
      },
      "biography": {
        "en": "Shreya Gupta is a Solutions Architect in Gen-AI at Nvidia, specializing in AI model development and optimization. She holds a Master’s in Symbolic Systems from Stanford, with research in deep learning and cognitive neuroscience. A passionate advocate for diversity in STEM, she has led Women Who Code Delhi and founded MLNerdie x Delhi to bridge the gap between academia and industry in machine learning."
      },
      "facebook": "",
      "twitter": "shreyagupta08",
      "linkedin": "shreya-gupta-08",
      "instagram": "",
      "github": "ShreyaGupta08",
      "website": "",
      "country": "in"
    },
    {
      "id": "peter-wang",
      "first_name": "Peter",
      "last_name": "Wang",
      "photo": "peter-wang.webp",
      "affiliation": {
        "en": "Chief AI and Innovation Officer at Anaconda, co-founder, PyData creator, impact on open-source AI, machine learning, edge computing, data privacy, decentralized computing, data science advocacy."
      },
      "biography": {
        "en": "Peter Wang is co-founder, Chief AI and Innovation Officer at Anaconda. He leads Anaconda’s AI Incubator, advancing Python technologies and open-source AI. A creator of the PyData community, he advocates for data science and literacy. His work spans edge computing, data privacy, and decentralized computing."
      },
      "facebook": "",
      "twitter": "pwang",
      "linkedin": "pzwang",
      "instagram": "",
      "github": "pzwang",
      "website": "",
      "country": "us"
    },
    {
      "id": "robert-erdmann",
      "first_name": "Robert",
      "last_name": "Erdmann",
      "photo": "robert-erdmann.webp",
      "affiliation": {
        "en": "Senior Scientist at Rijksmuseum, professor at the University of Amsterdam and Radboud University, expert in computer vision, machine learning, image processing, and cultural heritage preservation, leader in Bosch Research and Conservation Project."
      },
      "biography": {
        "en": "Robert Erdmann is a Senior Scientist at the Rijksmuseum and a professor at the University of Amsterdam and Radboud University. An expert in computer vision, machine learning, and image processing, he applies technology to preserve and understand cultural heritage. As a leader in the Bosch Research and Conservation Project, he develops advanced imaging and visualization techniques for art conservation."
      },
      "facebook": "",
      "twitter": "erdmann",
      "linkedin": "",
      "instagram": "",
      "github": "erdmann",
      "website": "",
      "country": "nl"
    }
  ]
}
