{
  "venue": [
    {
      "id": "eafit",
      "name": "EAFIT",
      "logo": "eafit.svg",
      "social": {
        "website": "https://www.eafit.edu.co/",
        "instagram": "nodo.eafit",
        "linkedin": "showcase/nodo-eafit"
      },
      "text": {
        "es": "Nodo es el centro de formación en tecnologías de la Universidad EAFIT, diseñado para ofrecer experiencias de aprendizaje prácticas y colaborativas, porque creemos que la mejor forma de aprender es haciendo.<br /><br />Con este enfoque, buscamos responder a los desafíos del presente y ser parte activa en la construcción de un futuro innovador. A través de nuestra conexión con el sector público y privado, generamos impacto y desarrollamos soluciones que trascienden, adaptándose a las necesidades de un entorno en constante cambio.<br /><br />Para lograrlo, contamos con un modelo modular que permite diseñar rutas de aprendizaje personalizadas, fortaleciendo las capacidades estratégicas de las organizaciones y potenciando el desarrollo profesional de sus equipos. En Nodo EAFIT, la tecnología no es solo una herramienta, sino el motor que impulsa la transformación de comunidades y organizaciones, construyendo un futuro más conectado, inclusivo y sostenible."
      },
      "photos": ["1.jpg", "2.jpg", "3.jpg", "4.jpg"],
      "video": "vExIUBmbe4c"
    }
  ],
  "platinum": [],
  "gold": [
    {
      "id": "genlogs",
      "name": "Genlogs",
      "logo": "genlogs.svg",
      "social": {
        "website": "https://www.genlogs.io/",
        "linkedin": "company/93806729",
        "twitter": "GenLogs"
      },
      "text": {
        "en": "​GenLogs is a truck intelligence company that provides real-time data and analytics to optimize logistics operations and combat fraud in the transportation industry. Leveraging a nationwide network of sensors, artificial intelligence, and real-time mobility data, GenLogs offers insights into freight patterns, carrier capacities, and asset tracking. This enables freight brokers, carriers, and shippers to make informed decisions, reduce costs, and enhance operational efficiency.​<br />​<br /> In addition to operational optimization, GenLogs plays a significant role in asset recovery and fraud prevention. The company has assisted in recovering over 1000 stolen or misused and offers investigative services to combat load theft, double brokering, and freight fraud.​<br />​<br />Founded in 2022 and based in Washington, D.C., GenLogs has secured substantial funding to expand its sensor network and technological capabilities. The company has raised $21 million since 2023, including a $14.6 million Series A funding round led by Venrock and HOF Capital.​<br />​<br />Furthermore, GenLogs collaborates with law enforcement agencies to address issues such as human trafficking, fentanyl smuggling, theft, and fraud, demonstrating its commitment to enhancing safety and security within the freight industry.",
        "es": "GenLogs es una empresa de inteligencia para camiones que proporciona datos y análisis en tiempo real para optimizar las operaciones logísticas y combatir el fraude en el sector del transporte. Aprovechando una red nacional de sensores, inteligencia artificial y datos de movilidad en tiempo real, GenLogs ofrece información sobre patrones de carga, capacidades de los transportistas y seguimiento de activos. Esto permite a los agentes de carga, transportistas y cargadores tomar decisiones informadas, reducir costes y mejorar la eficiencia operativa. ​<br />​<br /> Además de la optimización operativa, GenLogs desempeña un papel importante en la recuperación de activos y la prevención del fraude. La empresa ha ayudado a recuperar más de 1.000 cargas robadas o mal utilizadas y ofrece servicios de investigación para combatir el robo de cargas, la doble intermediación y el fraude en el transporte de mercancías. ​<br />​<br /> Fundada en 2022 y con sede en Washington D.C., GenLogs ha conseguido una importante financiación para ampliar su red de sensores y sus capacidades tecnológicas. La empresa ha recaudado 21 millones de dólares desde 2023, incluida una ronda de financiación de serie A de 14,6 millones liderada por Venrock y HOF Capital. ​<br />​<br /> Además, GenLogs colabora con las fuerzas de seguridad para hacer frente a problemas como la trata de seres humanos, el contrabando de fentanilo, el robo y el fraude, lo que demuestra su compromiso con la mejora de la seguridad en el sector del transporte de mercancías."
      },
      "photos": ["1.jpg", "2.jpg", "3.jpg", "4.jpg", "5.jpg"]
    },
    {
      "id": "elastic",
      "name": "Elastic",
      "logo": "elastic.svg",
      "social": {
        "website": "https://www.elastic.co/",
        "linkedin": "company/elastic-co",
        "facebook": "elastic.co",
        "twitter": "elastic"
      },
      "text": {
        "en": "Elastic is the leading platform for search-powered solutions, built on the open-source Elasticsearch engine. We help organizations find, observe, and protect their data across a wide range of use cases — from enterprise search and log analytics to application performance monitoring and cybersecurity. Elastic’s solutions are designed to scale seamlessly in the cloud and provide real-time insights that drive smarter decisions and faster actions.",
        "es": "Elastic es la plataforma líder en soluciones impulsadas por búsqueda, construida sobre el motor de código abierto Elasticsearch. Ayudamos a las organizaciones a encontrar, observar y proteger sus datos en una amplia variedad de casos de uso, desde búsqueda empresarial y análisis de registros hasta monitoreo de rendimiento de aplicaciones y ciberseguridad. Las soluciones de Elastic están diseñadas para escalar sin problemas en la nube y ofrecer información en tiempo real que impulsa decisiones más inteligentes y acciones más rápidas."
      },
      "photos": ["1.jpg", "2.png"],
      "video": "50T18ecNX7Q"
    },
    {
      "id": "mercado-libre",
      "name": "Mercado Libre",
      "logo": "mercado-libre.svg",
      "url": "https://www.mercadolibre.com/",
      "social": {
        "linkedin": "company/mercadolibre",
        "twitter": "Mercadolibre"
      },
      "text": {
        "en": "Mercado Libre is the leading company in e-commerce and financial technology in Latin America, with operations in 18 countries. It offers a complete ecosystem of solutions for individuals and businesses to buy, sell, advertise, obtain credit and insurance, collect, send money, save, and pay for goods and services both online and offline. Mercado Libre looks to facilitate access to commerce and financial services in Latin America, a market that offers great opportunities and high growth potential. It uses world-class technology to create intuitive solutions tailored to the local culture to transform the lives of millions of people in the region.",
        "es": "Mercado Libre es la compañía líder de comercio electrónico y fintech de América Latina. Presentes en 18 países, estamos transformando la forma de comprar, vender, pagar, financiar y hacer envíos.<br /><br />Desde hace 25 años apostamos por la democratización del comercio y los servicios financieros para transformar la vida de millones de personas en la región."
      }
    },
    {
      "id": "softserve",
      "name": "SoftServe",
      "logo": "softserve.svg",
      "url": "https://www.softserveinc.com/",
      "social": {
        "linkedin": "company/softserve",
        "facebook": "SoftServeColombia",
        "instagram": "softserve_people"
      },
      "text": {
        "en": "SoftServe is a premier IT consulting and digital services provider. We expand the horizon of new technologies to solve today's complex business challenges and achieve meaningful outcomes for our clients. Our boundless curiosity drives us to explore and reimagine the art of the possible. Clients confidently rely on SoftServe to architect and execute mature and innovative capabilities, such as digital engineering, data and analytics, cloud, and AI/ML.<br /><br />Our global reputation is gained from more than 30 years of experience delivering superior digital solutions at exceptional speed by top-tier engineering talent to enterprise industries, including high tech, financial services, healthcare, life sciences, retail, energy, and manufacturing.<br /><br />We partner with major technology players, such as Google Cloud Platform, Amazon Web Services, Microsoft Azure, Salesforce, and NVIDIA, to give clients a competitive advantage in the market.<br /><br />Founded in 1993, our global firm advises, drives innovation and develops the talent of people in the United States, Latin America, Europe and Asia.",
        "es": "SoftServe es un proveedor líder de consultoría en TI y servicios digitales. Ampliamos el horizonte de las nuevas tecnologías para resolver los complejos desafíos empresariales actuales y lograr resultados significativos para nuestros clientes. Nuestra curiosidad ilimitada nos impulsa a explorar y reinventar el arte de lo posible. Los clientes confían plenamente en SoftServe para diseñar y ejecutar capacidades maduras e innovadoras, como ingeniería digital, datos y analítica, nube e inteligencia artificial/aprendizaje automático (IA/ML).<br /><br />Nuestra reputación global se ha forjado a lo largo de más de 30 años de experiencia ofreciendo soluciones digitales superiores con una velocidad excepcional, gracias al talento de ingeniería de primer nivel, para industrias empresariales como alta tecnología, servicios financieros, salud, ciencias de la vida, comercio minorista, energía y manufactura.<br /><br />Colaboramos con los principales actores tecnológicos, como Google Cloud Platform, Amazon Web Services, Microsoft Azure, Salesforce y NVIDIA, para brindar a nuestros clientes una ventaja competitiva en el mercado.<br /><br />Fundada en 1993, en nuestra firma global asesoramos, impulsamos la innovación y desarrollamos el talento de las personas dentro de Estados Unidos, América Latina, Europa y Asia."
      },
      "photos": ["1.jpg", "2.jpg", "3.jpg", "4.jpg"]
    },
    {
      "id": "aimpoint",
      "name": "Aimpoint",
      "logo": "aimpoint.svg",
      "url": "https://www.aimpoint.com/",
      "social": {
        "linkedin": "company/aimpoint",
        "twitter": "AimpointAI"
      },
      "text": {
        "en": "Aimpoint Digital is a market-leading analytics, data engineering, operations research, and Artificial Intelligence advisory and solution engineering firm.",
        "es": "Aimpoint Digital es una firma líder en el mercado especializada en analítica, ingeniería de datos, investigación de operaciones  e inteligencia artificial, dedicada a la consultoría y al desarrollo de soluciones."
      },
      "photos": ["1.jpg", "2.jpg", "3.jpg", "4.jpg", "5.jpg"]
    }
  ],
  "silver": [],
  "bronze": [
    {
      "id": "provectus",
      "name": "Provectus",
      "logo": "provectus.svg",
      "url": "https://provectus.com/",
      "text": {
        "en": "We bring the power of cloud, data and AI to reimagine the way businesses operate, compete, and deliver customer value.",
        "es": "Impulsamos la transformación empresarial con el poder de la nube, los datos y la inteligencia artificial, reinventando la forma en que las compañías operan, compiten y entregan valor a sus clientes."
      },
      "photos": ["1.jpg", "2.jpg", "3.jpg", "4.jpg", "5.jpg", "6.jpg", "7.jpg"],
      "video": "Mw7ZZ_JzjrQ"
    }
  ],
  "startup": [
    {
      "id": "howdy",
      "name": "Howdy",
      "logo": "howdy.svg",
      "text": {
        "es": "<b>Howdy conecta talento de América Latina con las mejores oportunidades en Estados Unidos.</b><br /><br />Con base en Texas, EE.UU., nos especializamos en integrar desarrolladores directamente en equipos de ingeniería en EE. UU., sin intermediarios ni estructuras tradicionales.<br /><br />En Howdy, el talento es el centro de todo. Apostamos por relaciones laborales de largo plazo, en las que el crecimiento profesional y personal se acompaña con un modelo pensado para el bienestar de nuestros colaboradores: salarios competitivos, trabajo remoto, comunidad activa, mentorías personalizadas y un entorno de apoyo constante.<br /><br />Más que una plataforma de contratación, somos lo mejor de los dos mundos: trabajo para Estados Unidos y acceso a una comunidad local en tu país.",
        "en": "<b>Howdy connects talent from Latin America with top opportunities in the United States.</b><br /><br />Based in Texas, USA, we specialize in integrating developers directly into U.S. engineering teams—no middlemen, no traditional structures.<br /><br />At Howdy, talent is at the center of everything we do. We focus on long-term work relationships where professional and personal growth go hand in hand with a model designed for our team’s well-being: competitive salaries, remote work, an active community, personalized mentorship, and a constant support system.<br /><br />More than just a hiring platform, we offer our engineers the best of both worlds: job opportunities in the U.S. and access to a local community in their own country."
      },
      "social": {
        "website": "https://www.howdylatam.com",
        "linkedin": "company/howdy",
        "twitter": "Howdy"
      },
      "photos": ["1.jpg", "2.JPG", "3.JPG", "4.jpg"]
    }
  ]
}
